Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, None, None,  0                                            
__________________________________________________________________________________________________
input_2 (InputLayer)            [(None, 4, 4)]       0                                            
__________________________________________________________________________________________________
roi_pooling_conv (RoiPoolingCon (1, 4, 7, 7, 512)    0           input_1[0][0]                    
                                                                 input_2[0][0]                    
__________________________________________________________________________________________________
time_distributed (TimeDistribut (1, 4, 25088)        0           roi_pooling_conv[0][0]           
__________________________________________________________________________________________________
time_distributed_1 (TimeDistrib (1, 4, 4096)         102764544   time_distributed[0][0]           
__________________________________________________________________________________________________
time_distributed_2 (TimeDistrib (1, 4, 4096)         0           time_distributed_1[0][0]         
__________________________________________________________________________________________________
time_distributed_3 (TimeDistrib (1, 4, 4096)         16781312    time_distributed_2[0][0]         
__________________________________________________________________________________________________
time_distributed_4 (TimeDistrib (1, 4, 4096)         0           time_distributed_3[0][0]         
__________________________________________________________________________________________________
dense_class_3 (TimeDistributed) (1, 4, 3)            12291       time_distributed_4[0][0]         
__________________________________________________________________________________________________
dense_regress_3 (TimeDistribute (1, 4, 8)            32776       time_distributed_4[0][0]         
==================================================================================================
Total params: 119,590,923
Trainable params: 119,590,923
Non-trainable params: 0
__________________________________________________________________________________________________
